# AnalyticalNodeData Properties

---
The AnalyticalNodeData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace